//
//  Privacy Policy.swift
//  Waving-iOS
//
//  Created by Joy on 1/26/24.
//

import Foundation

struct PrivacyPolicy {
    static let full = """
    **제1조(목적)**

    웨이빙(이하 회사'라고 함)는 회사가 제공하고자 하는 서비스(이하 ‘회사 서비스'）를 이용하는 개인(이 하 ‘이용자’ 또는 ‘개인'）의 정보(이하 ‘개인정보'）를 보호하기 위해, 개인정보보호법, 정보통신망 이용 촉진 및 정보보호 등에 관한 법률(이하 '정보통신방법'）등 관련 법령을 준수하고, 서비스 이용자의 개인 정보 보호 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보처리 방침(이하 ‘본 방침')을 수립합니다.

    **제2조(개인정보 처리의 원칙)**

    개인정보 관련 법령 및 본 방침에 따라 희사는 이용자의 개인정보를 수집할 수 있으며 수집된 개인정보 는 개인의 동의가 있는 경우에 한해 제3자에게 제공될 수 있습니다. 단, 법령의 규정 등에 의해 적법하 게 강제되는 경우 회사는 수집한 이용자의 개인정보를 사전에 개인의 동의 없이 제3자에게 제공할 수도 있습니다.

    **제3조(회원 가입을 위한 정보)**

    회사는 이용자의 회사 서비스에 대한 회원가입을 위하여 다음과 같은 정보를 수집합니다.

    1. 필수 수집 정보: **이메일 주소, 비밀번호, 이름, 닉네임, 생년월일 및 휴대폰 번호**
    2. 보유 및 이용기간 : 단체의 앱에서 회원 탈퇴 시까지

    **제4조(본인 인증을 위한 정보)**

    회사는 이용자의 본인인증을 위하여 다음과 같은 정보를 수집합니다.

    1. 필수 수집 정보: **휴대폰 번호, 이메일 주소, 이름 및 생년월일**
    2. 보유 및 이용기간 : 본인인증 완료 시까지

    **제5조(개인정보 수집 방법)**

    회사는 다음과 같은 방법으로 이용자의 개인정보를 수집합니다.

    1. **어플리케이션 등 회사가 제공하는 홈페이지 외의 서비스를 통해 이용자가 자신의 개인정보를 입력하는 경**

    **제6조(개인정보의 이용)**

    회사는 개인정보를 다음 각 호의 경우에 이용합니다.

    1. **공지사항의 전달 등 회사의 운영에 필요한 경우**
    2. **이용문의에 대한 회신, 불만의 처리 등 이용자에 대한 서비스 개선을 위한 경우**
    3. **회사의 서비스를 제공하기 위한 경우**
    4. **인구통계학적 분석, 서비스 방문 및 이용기록의 분석을 위한 경우**
    5. **법령 및 회사 약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위에 대한 방지 및 제재를 위한 경우**

    **제7조(개인정보의 보유 및 이용기간)**

    1. 회사는 이용자의 개인정보에 대해 개인정보의 수집•이용목적 달성을 위한 기간동안 개인정보를 보유 및 이용합니다.
    2. 전항에도 불구하고 회사는 내부 방침에 의해 서비스 부정이용기록은 부정 가입 및 이용 방지를 위하여 회원 탈퇴 시점으로부터 최대 1년간 보관할 수 있습니다.

    **제8조(개인정보의 파기원칙)**

    회사는 원칙적으로 이용자의 개인정보 처리 목적의 달성, 보유·이용기간의 경과 등 개인정보가 필요하지 않을 경우에는 해당 정보를 지체 없이 파기합니다.

    **제9조(미이용자의 개인정보 파기 등에 관한 조치)**

    1. 1년 간 서비스를 이용하지 않은 이용자의 정보를 파기하고 있습니다. 다만, 다른 법령에서 정한 보존기간이 경과할 때까지 다른 이용자의 개인정보와 분리하여 별도로
    저장·관리할 수 있습니다.
    2. 개인정보의 파기를 원하지 않으시는 경우, 기간 만료 전 서비스 로그인을 하시면 됩니다.

    **제10조(개인정보파기절차)**

    1. 이용자가 회원가입 등을 위해 입력한 정보는 개인정보 처리 목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참 조) 일정 기간 저장된 후 파기 되어집니다.
    2. 회사는 파기 사유가 발생한 개인정보를 개인정보보호 책임자의 승인절차를 거쳐 파기합니다.

    **제11조(개인정보파기방법)**

    회사는 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제하 며, 종이로 출력된 개인정보는 분쇄기로 분쇄하거나 소각 등을 통하여 파기합니다.

    **제12조(이용자의 의무)**

    1. 이용자는 자신의 개인정보를 최신의 상태로 유지해야 하며, 이용자의 부정확한 정보 입력으로 발생하는 문제의 책임은 이용자 자신에게 있습니다.
    2. 타인의 개인정보를 도용한 회원가입의 경우 이용자 자격을 상실하거나 관련 개인정보보호 법령에 의해 처벌 받을 수 있습니다.
    3. 이용자는 전자우편주소, 비밀번호등에 대한 보안을 유지할 책임이 있으며 제3자에게 이를 양도하거나 대여 할 수 없습니다.

    **제13조(개인정보 유출 등에 대한 조치)**

    회사는 개인정보의 분실·도난·유출(이하 ”유출 등"이라 한다) 사실을 안 때에는 지체 없이 다음 각 호의 모든 사항을 해당 이용자에게 알리고 방송통신위원회 또는 한국인터넷진흥원에 신고합니다.

    1. 유출등이 된 개인정보항목
    2. 유출동이 발생한시점
    3. 이용자가취할수있는조치
    4. 정보통신서비스제공자등의 대응조치
    5. 이용자가 상담등을 접수 할 수 있는 부서 및 연락처

    **제14조(개인정보 유출 등에 대한 조치의 예외)**

    회사는 전조에도 불구하고 이용자의 연락처를 알 수 없는 등 정당한 사유가 있는 경우에는 회사의 홈페이지에 30일 이상 게시하는 방법으로 전조의 통지를 갈음하는 조치를 취할 수 있습니다.

    **제15조(회사의 개인정보 보호 책임자 지정)**

    1. 회사는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부 서 및 개인정보 보호 책임자를 지정하고 있습니다.
    2. 개인정보보호책임자
    - 성명: 민성희
    - 이메일: [m](mailto:mindrainl2@gmail.com)sh618@naver.com
    1. 정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
    - 개인정보분쟁조정위원회 : (국번없이) 1833-6972 ([www.kopico.go.kr](http://www.kopico.go.kr/))
    - 개인정보침해신고센터 : (국번없이) 118 ([privacy.kisa.or.kr](http://privacy.kisa.or.kr/))
    - 대검찰청 : (국번없이) 1301 ([www.spo.go.kr](http://www.spo.go.kr/))
    - 경찰청 : (국번없이) 182 ([ecrm.cyber.go.kr](http://ecrm.cyber.go.kr/))

    **제16조(정보주체의 권리·의무 및 행사방법)**

    1. 정보주체는 개인정보처리자에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의
    권리를 행사할 수 있습니다.
    2. 권리 행사는 개인정보처리자명에 대해 「개인정보 보호법」 시행령 제41조 제1항에 따라
    전자우편 등을 통하여 하실 수 있으며, 개인정보처리자은(는) 이에 대해
    지체없이 조치하겠습니다.

    [시행일] 이 개인정보 처리방침은 2023. 7. 28부터 적용됩니다.
    """
}
