//
//  TermsOfService.swift
//  Waving-iOS
//
//  Created by Joy on 1/26/24.
//

import Foundation

struct TermsOfService {
    static let full = """
    웨이빙 이용약관(이하 ‘본 약관’이라 함)은 팅커벨(이하 ‘단체’라 함)가 본 서비스를 이용하는 이용자(이하 ‘이용자’라 함)에게 제공하는 모든 서비스(이하 ‘서비스’라 함)의 이용에 관한 조건에 대해 정합니다.

    ## 제 1조 (정의)

    본 약관에서 사용하는 용어의 정의는 다음과 같습니다.

    ① ‘서비스’란 단말기를 통해 회원이 이용할 수 있는 지인 연락관리 서비스 및 관련 제반 앱 서비스를 의미합니다.

    ② ‘이용자’란  웨이빙 서비스를 접속하여 본 이용약관에 따라 이용 계약을 체결한 후 웨이빙 서비스를 이용하는 이용자를 말합니다.

    ## 제 2조 (약관 동의)

    ① 고객은 본 약관에 따라 본 서비스를 이용해야 합니다. 고객은 본 약관에 대해 동의를 했을 경우에 한하여 본 서비스를 이용할 수 있습니다.

    ② 단체는 이 약관을 서비스를 이용하고자 하는 자와 회원이 알 수 있도록 서비스가 제공되는 앱 가입화면 초기 화면 또는 마이 페이지에 게시합니다.

    ③ 본 약관에 동의하는 것은 정기적으로 서비스를 방문하여 본 약관의 변경사항을 확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못해 발생하는 이용자의 피해는 단체에서 책임지지 않습니다.

    ## 제 3조 (약관 변경)

    본 약관의 변경이 필요하다고 판단될 경우, 회사는 관련 법령에 따라 본 서비스 목적의 범위 내에서 본 약관을 변경할 수 있습니다. 이때 회사는 본 약관의 변경본의 내용과 변경의 효력일을 본 서비스 또는 회사의 웹사이트에 게시하거나, 이를 회사가 정한 방법으로 고객에게 통지하여야 합니다.
    본 약관의 변경본은 그 효력일로부터 효력이 발생합니다.

    ## 제 4조 (약관 외 준칙)

    본 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법 및 기타 관련법령의 규정에 준합니다.

    ## 제 5조 (이용계약의 체결)

    ① 서비스 이용을 위해 고객은 특정 정보를 등록하여 계정을 생성해야 할 수 있습니다. 고객은 진실하고 정확하며 완전한 정보를 등록해야 하며 언제나 최신 정보가 적용되도록 수정해야 합니다.

    ② 회원이 입력한 정보는 사실로 간주합니다. 내용이 사실과 다를 경우(차명, 비실명, 허위정보 등)와 타인의 정보를 도용한 사실이 명백하게 확인 되는 경우, 단체는 회원에게 회원의 권한을 삭제하며 서비스의 전면적인 이용을 거부 할 수 있고, 이로 인해 발생하는 모든 불이익은 단체가 책임지지 않습니다. 또한 단체는 이를 위하여 필요한 경우에는 제증명을 요구할 수 있습니다.

    ③ 서비스의 이용자는 언제라도 계정을 삭제하고 탈퇴할 수 있습니다.

    ④ 단체는 마지막 접속 시점부터 1년 이상 경과한 계정을 해당 고객에 대한 사전 통지 없이 삭제할 수 있습니다.

    ⑤ 고객이 본 서비스에서 가지는 모든 이용 권한은 계정이 삭제된 시점에 소멸됩니다. 고객의 실수로 계정을 삭제한 경우에도 계정을 복구할 수 없음에 유의하시기 바랍니다.

    ⑥ 본 서비스의 계정은 고객에게 일신전속적으로 귀속됩니다. 고객이 본 서비스에서 가지는 모든 이용권은 제3자에게 양도, 대여 또는 처분할 수 없으며, 제3자에게 상속 또는 승계될 수 없습니다.

    ⑦ 단체는 제1항목과 같은 방법으로 회원 가입을 신청한 회원이 아래 각 호에 해당하는 조건을 충족 하지 못할 경우 회원가입 승낙을 유보 또는 거부 할 수 있습니다.

    (1) 등록내용 허위게재 사실이 있는 경우

    (2) 제 3자의 전자우편 주소를 이용하여 신청한 경우

    (3) 약관 및 서비스 이용에 관한 관계법령을 위반하여 회원자격을 상실 된 자.

    (4) 사회적 질서 및 미풍양속에 문란이 되는 행위자.

    (5) 기타 가입결격 사유에 해당한 자.

    ## **제 6조 (개인정보보호 의무)**

    단체는 "정보통신망법" 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및 단체의 개인정보취급방침이 적용됩니다. 다만, 단체의 공식 사이트 이외의 링크된 사이트에서는 단체의 개인정보취급방침이 적용되지 않습니다

    ## 제 7조 (서비스 제공)

    ① 고객은 본 서비스를 이용하는 데 있어 필요한 PC나 휴대전화 단말기, 스마트폰 및 기타 통신 기기, 운영 체제, 통신 수단 및 전력 등을 고객의 비용과 책임 하에 준비해야 합니다.

    ② 단체는 본 서비스의 전부 또는 일부를 고객의 연령 및 본인 확인 여부, 등록정보 유무 등 단체가 필요하다고 판단한 조건을 만족시키는 이용자에 한하여 제공할 수 있습니다.

    ③ 단체는 필요하다고 판단될 경우, 고객에 대한 사전 통지 없이 언제라도 본 서비스의 전부 또는 일부 내용을 변경할 수 있습니다.

    ④ 단체는 다음 각 호의 경우 고객에 대한 사전 통지 없이 언제라도 서비스의 전부 또는 일부의 제공을 중지할 수 있습니다.

    1. 시스템을 유지보수 또는 수리하는 경우
    2. 사고(화재, 정전 등), 천재지변, 전쟁, 폭동, 노동 쟁의 등 불가항력으로 인해 본 서비스를 제공할 수 없는 경우
    3. 시스템이 고장 나거나 심각한 부하가 걸리는 경우
    4. 고객 또는 제3자의 안전을 확보하거나 공공복리를 위한 비상사태의 경우
    5. 1.부터 4.까지 명시된 사항 이외에 회사가 필요하다고 합리적으로 판단하는 경우

    ⑧회원가입 계약 성립 시점은, 가입 승낙이 가입 신청자에게 도달한 시점을 기준으로 합니다.

    ## 제 8조 (정보제공 및 광고 게재)

    ①단체는 서비스의 운영과 관련하여 서비스 화면, 홈페이지, 전자우편 등에 광고를 게재할 수 있습니다. 회원은 서비스 이용시 노출 되는 광고 게재에 대해 동의합니다.

    ②  단체는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편, 문자 SMS 발송 등의 방법으로 회원에게 제공할 수 있습니다.

    ③ 광고가 게재된 전자우편을 수신한 이용자는 수신거절을 단체에게 할 수 있습니다.

    ④ 이용자는 단체가 제공하는 서비스와 관련하여 게시물 또는 기타 정보를 변경, 수정, 제한하는 등의 조치를 취하지 않습니다.

    ## 제8조 (단체의 의무)

    ① 단체는 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.

    ②  단체는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보취급방침을 공시하고 준수합니다.

    ## 제9조 (이용자의 의무)

    ① 이용자는 단체의 사전 승낙 없이 서비스를 이용하여 영업활동을 할 수 없으며, 해당 영업활동의 결과에 대해 단체는 책임을 지지 않습니다. 또한 이용자는 이와 같은 영업활동으로 단체가 손해를 입은 경우, 회원은 단체에 대해 손해배상의무를 지며, 단체는 해당 이용자에 대해 서비스 이용제한 및 적법한 절차를 거쳐 손해배상 등을 청구할 수 있습니다.

    ② 이용자는 단체의 명시적 동의가 없는 한 서비스의 이용권한, 기타 이용계약상의 지위를 타인에게 양도, 증여할 수 없으며 이를 담보로 제공할 수 없습니다.

    ③ 이용자는 단체 및 제 3자의 지적 재산권을 침해해서는 안됩니다. 해당 지적 재산권 침해의 결과에 대해 단체는 책임을 지지 않습니다.

    ④ 단체는 이용자가 서비스에 관하여 관련 법령 또는 본 약관을 위반하거나 또는 위반할 우려가 있다고 판단한 경우 또는 기타 단체의 업무상 필요한 경우, 이용자에게 사전 통지 없이 이용자 제한 및 적법조치를 포함한 제재를 가할 수 있습니다.

    ## 제10조 (’인사말’의 권리와 책임)

    1. 회원이 서비스 내에 작성한 텍스트, 이미지, 링크 등의 기타 정보(이하 "게시물")에 대한 책임 및 권리는 게시물을 등록한 회원에게 있습니다.

    2. 단체는 회원이 작성한 컨텐츠에 대해서 감시 및 관리할 수 없으며 이에 대해서 책임지지 않습니다. 단체는 회원이 등록하는 게시물의 신뢰성, 진실성, 정확성 등에 대해서 책임지지 않으며 보증하지 않습니다.

    3. 서비스에 대한 저작권 및 지적재산권, 단체가 작성한 게시물의 저작권은 단체에 귀속됩니다. 단, 회원이 단독 또는 공동으로 작성한 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.

    4. 회원은 자신이 서비스 내에 게시한 게시물을 단체가 국내ㆍ외에서 다음 목적으로 사용하는 것을 허락합니다.

    - 서비스(제3자가 운영하는 사이트 또는 미디어의 일정 영역 내에 입점하여 서비스가 제공되는 경우를 포함합니다)내에서 게시물을 사용하기 위하여 게시물의 크기를 변환하거나 단순화하는 등의 방식으로 수정하는 것
    - 단체에서 운영하는 다른 사이트 또는 다른 회사가 운영하는 사이트에 게시물을 복제ㆍ전송ㆍ전시하는 것
    - 단체의 서비스를 홍보하기 위한 목적으로 미디어, 통신사 등에게 게시물의 내용을 보도, 방영하게 하는 것. 단, 이 경우 단체는 회원의 개별 동의없이 미디어, 통신사 등에게 게시물 또는 회원정보를 제공하지 않습니다.

    5. 회원이 회원탈퇴를 한 경우에는 본인 도메인에 기록된 저작물 일체는 삭제됩니다. 단, 저작물이 공동 저작을 통해 작성된 경우에는 공동 저작자의 도메인에 해당 게시물이 남을 수 있고, 제3자에 의하여 보관되거나 무단복제 등을 통하여 복제됨으로써 해당 저작물이 삭제되지 않고 재 게시된 경우에 대하여 단체는 책임을 지지 않습니다. 또한, 본 약관 및 관계 법령을 위반한 회원의 경우 다른 회원을 보호하고, 법원, 수사기관 또는 관련 기관의 요청에 따른 증거자료로 활용하기 위해 회원탈퇴 후에도 관계 법령이 허용하는 한도에서 회원의 아이디 및 회원정보를 보관할 수 있습니다.

    6. 회원의 게시물 또는 저작물이 단체 또는 제3자의 저작권 등 지적재산권을 침해함으로써 발생하는 민∙형사상의 책임은 전적으로 회원이 부담하여야 합니다.

    ## 제 11조 (계약해제, 해지 등)

    1. 이용자는 언제든지 정보 관리 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며, 단체는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.

    2. 이용자가 계약을 해지할 경우, 본 이용약관, 관련법 및 개인정보취급방침에 따라 단체가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 이용자의 모든 데이터는 소멸됩니다.

    3. 이용자의 의무를 성실하게 이행하지 않거나, 약관에서 정한 회원의 의무 및 이용정책에 위반되는 해당하는 행위를 한 이용자는 사전 동의 없이 강제 탈퇴 처리할 수 있습니다.

    4. 기타 이용자의 여건상 지속적인 계약을 이행하지 못한다고 판단될 경우 임의탈퇴 처리할 수 있습니다.

    (예: 사망 또는 행방불명, 12개월 이상 활동을 하지 않는 휴면계정 회원 등)

    ## 제 12조 (면책조항)

    1. 단체는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.

    2. 단체는 이용자의 귀책사유로 인한 서비스 이용 장애에 대한 책임을 면제합니다.

    3. 단체는 이용자가 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.

    4. 단체는 이용자가 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않습니다.

    5. 단체는 이용자의 신원을 보증하지 않습니다. 또한 이용자가 서비스를 이용하며 타 이용자로 인해 입게 되는 정신적 피해에 대하여 보상할 책임을 지지 않습니다.

    6. 단체는 이용자 상호간 및 이용자와 제 3자 상호 간에 서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없으며, 이로 인한 손해를 배상할 책임도 없습니다.

    7. 단체의 게시물에 이용자가 게재한 글의 저작권은 회원 본인에게 있으며, 이 정보의 진실성 및 저작권에 위배되어 민 형사 상의 문제가 발생 시 책임은 이용자 본인에게 있습니다.

    8. 단체의 사이트에 게재된 제3의 사이트 주소에 관하여 단체는 어떠한 통제권도 없으며 이로 인하여 발생 하는 손해는 이용자 본인에게 있습니다.

    9. 단체에서 이용자에게 무료로 제공하는 서비스의 이용과 관련해서는 어떠한 손해도 책임을 지지 않습니다.

    ### **제 15조 (분쟁의 해결)**

    1. 단체와 이용자는 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 노력을 합니다.

    2. 단체는 이용자로부터 제출되는 불만사항 및 의견을 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자께 그 사유와 처리 일정을 즉시 통보해 드립니다.

    ### **제 16조 (재판권 및 준거법)**

    1. 이 약관에 명시되지 않은 사항은 전기통신사업법 등 관계법령과 상관습에 따릅니다.

    2. 단체의 기타 유료 서비스 이용 회원의 경우, 단체가 별도로 정한 정책에 따릅니다.

    3. 서비스 이용으로 발생한 분쟁에 대해 소송이 제기되는 경우 단체의 소재지를 관할하는 법원을 관할 법원으로 합니다.

    [시행일] 본 서비스 이용약관은 2023년 7월 28일부터 적용됩니다.
    
    """
}
